ams/src/DataProcessors/AMS_Маркетплейс/AMS_Маркетплейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_Маркетплейс</name>
</mdclass:DataProcessor>

ams/src/Documents/ОтчетОСписанииТоваровСХранения/ОтчетОСписанииТоваровСХранения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетОСписанииТоваровСХранения</name>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИсправленияДокументов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <type>
      <types>CatalogRef.ОтветственныеЛицаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <type>
      <types>EnumRef.ПорядокРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.АктОРасхожденияхПослеПриемки</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <type>
      <types>Characteristic.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидыЗапасовУказаныВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>CatalogRef.ОбъектыРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаСчетовУчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправляемыйДокумент</name>
    <type>
      <types>DocumentRef.ОтчетОСписанииТоваровСХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикОплаты</name>
    <type>
      <types>CatalogRef.ГрафикиОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМестаХранения</name>
      <type>
        <types>EnumRef.ТипыМестХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Хранитель</name>
      <type>
        <types>CatalogRef.Партнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРасчетов</name>
      <type>
        <types>CatalogRef.ОбъектыРасчетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/DataProcessors/AMS_Маркетплейс/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	// Возврат при получении формы для анализа.
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокКомиссионеров()
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	УстановитьОтбор();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДокументыСборкаНаборов

&НаКлиенте
Процедура ДокументыСборкаНаборовПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(МатериалыСборкаНаборов.Отбор,"Ссылка",,ВидСравненияКомпоновкиДанных.Равно,,Истина);
    Иначе
        Док = Элемент.ТекущаяСтрока;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(МатериалыСборкаНаборов.Отбор,"Ссылка",Док,ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьОтчетКомиссионера(Команда)
	Если ПартнерКод = "01-01002322"          //Алькор и Ко (Летуаль)
		Или ПартнерКод = "01-01002250"       //Интернет Решения (OZON)
		Или ПартнерКод = "01-01002442"       //Детский мир маркетплейс
		Или ПартнерКод = "01-01002441"       //МАГНИТ МАРКЕТ ООО
		Или ПартнерКод = "01-01002247"       //РВБ (Валберис)
		Или ПартнерКод = "01-01002235" Тогда //Яндекс Маркет ООО

		ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОбработчикОкончанияПомещения", ЭтотОбъект, Партнер);
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
		ПараметрыДиалога.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
		ПараметрыДиалога.Заголовок ="Выбирите файл отчета комиссионера """ + ПартнерНаименование + """";
		ПараметрыДиалога.МножественныйВыбор = Ложь;
		
		НачатьПомещениеФайлаНаСервер(ОбработкаОкончанияПомещения, , , , ПараметрыДиалога, УникальныйИдентификатор);
		
	Иначе
		Текст = НСтр("ru = 'Модуль загрузки для данного комиссионера отсутствует!'");
		СообщитьПользователю(Текст, "Партнер", "Объект");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыкупТоваров(Команда)
	Если 
		ПартнерКод = "01-01002247"        Тогда //РВБ (Валберис)
		//Или ПартнерКод = "01-01002322"          //Алькор и Ко (Летуаль)
		//Или ПартнерКод = "01-01002250"       //Интернет Решения (OZON)
		//Или ПартнерКод = "01-01002442"       //Детский мир маркетплейс
		//Или ПартнерКод = "01-01002441"       //МАГНИТ МАРКЕТ ООО
		//Или ПартнерКод = "01-01002235" Тогда //Яндекс Маркет ООО

		ОбработкаОкончанияПомещения = Новый ОписаниеОповещения("ОбработчикОкончанияПомещения", ЭтотОбъект, Партнер);
		
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов();
		ПараметрыДиалога.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
		ПараметрыДиалога.Заголовок ="Выбирите файл отчета комиссионера """ + ПартнерНаименование + """";
		ПараметрыДиалога.МножественныйВыбор = Ложь;
		
		НачатьПомещениеФайлаНаСервер(ОбработкаОкончанияПомещения, , , , ПараметрыДиалога, УникальныйИдентификатор);
		
	Иначе
		Текст = НСтр("ru = 'Модуль загрузки для данного комиссионера отсутствует!'");
		СообщитьПользователю(Текст, "Партнер", "Объект");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СообщитьПользователю(Текст, Поле, ПутьКДанным, КлючДанных = Неопределено)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	
	Если Не КлючДанных = Неопределено Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Сообщение.Сообщить();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор()
	Стр = ОбщегоНазначенияУТВызовСервера.ЗначенияРеквизитовОбъекта(Партнер, "Код, Наименование");
	ПартнерКод          = Стр.Код;
	ПартнерНаименование = Стр.Наименование;
	
	ОтборПоПартнеру = ЗначениеЗаполнено(Партнер);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗаказыКлиента.Отбор,"ХозяйственнаяОперация",
		Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию, ВидСравненияКомпоновкиДанных.Равно,, Истина);
										
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ЗаказыКлиента.Отбор,"Партнер",
		Партнер, ВидСравненияКомпоновкиДанных.Равно,, ОтборПоПартнеру);
										
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПередачиТоваровХранителю.Отбор,"Партнер",
		Партнер, ВидСравненияКомпоновкиДанных.Равно,, ОтборПоПартнеру);
										
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтчетыКомиссионера.Отбор,"Партнер",
		Партнер, ВидСравненияКомпоновкиДанных.Равно,, ОтборПоПартнеру);
										
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ПоступлениеТоваровОтХранителя.Отбор,"Партнер",
		Партнер, ВидСравненияКомпоновкиДанных.Равно,, ОтборПоПартнеру);
										
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(РеализацияТоваровУслуг.Отбор,"ХозяйственнаяОперация",
		Перечисления.ХозяйственныеОперации.РеализацияЧерезКомиссионера, ВидСравненияКомпоновкиДанных.Равно,, Истина);
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(РеализацияТоваровУслуг.Отбор,"Партнер",
		Партнер, ВидСравненияКомпоновкиДанных.ВСписке,, ОтборПоПартнеру);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОкончанияПомещения(ОписаниеПомещенногоФайла, ДополнительныеПараметры = Неопределено) Экспорт
	Если ОписаниеПомещенногоФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ИмяФайла = ОписаниеПомещенногоФайла.СсылкаНаФайл.Имя;
		
	Данные = ПрочитатьИзВременногоХранилища(ОписаниеПомещенногоФайла.Адрес, ДополнительныеПараметры);
		
	Парам = Новый Структура();
	Парам.Вставить("Комиссионер", ДополнительныеПараметры);
	Парам.Вставить("Данные", Данные.Продажа);
	
	ПараметрыЗаполненияФормы = Новый Структура("Маркетплейс", Парам);
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчетыКомиссионера Тогда
		ОткрытьФорму("Документ.ОтчетКомиссионера.Форма.ФормаДокумента", ПараметрыЗаполненияФормы);
		// Далее см. AMS_СобытияФорм.СформироватьДокументаОтчетКомиссионера
	Иначе
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента", ПараметрыЗаполненияФормы);
		// Далее см. AMS_СобытияФорм.СформироватьОтчетКомиссионера
	КонецЕсли;

	Если Не Данные.Списание = Неопределено Тогда
		Парам = Новый Структура();
		Парам.Вставить("Комиссионер", ДополнительныеПараметры);
		Парам.Вставить("Данные", Данные.Списание);
		
		ПараметрыЗаполненияФормы = Новый Структура("Маркетплейс", Парам);
		
		ОткрытьФорму("Документ.ОтчетОСписанииТоваровСХранения.Форма.ФормаДокумента", ПараметрыЗаполненияФормы);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПрочитатьИзВременногоХранилища(АдресВХ, ДополнительныеПараметры)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВХ);
	
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	СпособЧтения = СпособЧтенияЗначенийТабличногоДокумента.Текст;
	
	Попытка
		ТабДок.Прочитать(ИмяВременногоФайла, СпособЧтения);
	
	Исключение
		ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьИзВременногоХранилища.Ошибка: Не удалось прочитать файл из временного хранилища по причине: %Причина%'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаОтчетыКомиссионера Тогда
		Если ПартнерКод = "01-01002322" Тогда      //Алькор и Ко (Летуаль)
			Данные = ПрочитатьФайлЛетуаль();

		ИначеЕсли ПартнерКод = "01-01002442" Тогда //Детский мир маркетплейс
			Данные = ПрочитатьФайлДетскийМир();
			
		ИначеЕсли ПартнерКод = "01-01002250" Тогда //Интернет Решения (OZON)
			Данные = ПрочитатьФайлOzon();
		
		ИначеЕсли ПартнерКод = "01-01002441" Тогда //МАГНИТ МАРКЕТ ООО
			Данные = ПрочитатьФайлМагнитМаркет();
		
		ИначеЕсли ПартнерКод = "01-01002247" Тогда //РВБ (Валберис)
			Данные = ПрочитатьФайлWB();
			
		ИначеЕсли ПартнерКод = "01-01002235" Тогда //Яндекс Маркет ООО
			Данные = ПрочитатьФайлЯндексМаркет();
		КонецЕсли;
		
	Иначе
		Если ПартнерКод = "01-01002247" Тогда //РВБ (Валберис)
			Данные = ПрочитатьФайлВыкупаWB();
		КонецЕсли;
	КонецЕсли;
		
	УдалитьФайлы(ИмяВременногоФайла);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлЛетуаль()
	ЛистДТ = ТабДок.ПолучитьОбласть("Отчет");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	Счет = 0;
	
	Для НомерСтроки = 14 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Артикул    = ЛистДТ.Область(НомерСтроки, 5, НомерСтроки, 5).Текст;
			Цена       = Число(ЛистДТ.Область(НомерСтроки, 16, НомерСтроки, 16).Текст);
			Количество = Число(ЛистДТ.Область(НомерСтроки, 17, НомерСтроки, 17).Текст);

			Счет  = Счет + 1;
			
			Стр1 = Табл.Добавить();

			Стр1.НомерСтроки  = Счет;
			Стр1.Артикул      = Артикул;
			Стр1.Количество   = Количество;
			Стр1.Цена         = Цена;
		Исключение
			Продолжить;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Данные = Новый Структура();
	
	Данные.Вставить("Продажа",  Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлДетскийМир()
	ЛистДТ = ТабДок.ПолучитьОбласть("Продажи");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	Счет = 0;
	Для НомерСтроки = 31 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Счет  = Счет + 1;
			
			Артикул = ЛистДТ.Область(НомерСтроки, 7, НомерСтроки, 7).Текст;
			
			Если ПустаяСтрока(Артикул) Тогда
				Прервать;
			КонецЕсли;
			
			Количество = Число(ЛистДТ.Область(НомерСтроки, 13, НомерСтроки, 13).Текст);
			Цена       = Число(ЛистДТ.Область(НомерСтроки, 21, НомерСтроки, 21).Текст);
			
			Стр1 = Табл.Добавить();
			Стр1.НомерСтроки = Счет;
			Стр1.Артикул     = Артикул;
			Стр1.Количество  = Количество;
			Стр1.Цена        = Цена;
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлДетскийМир.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Данные = Новый Структура();
	
	Данные.Вставить("Продажа",  Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлOzon()
	ЛистДТ = ТабДок.ПолучитьОбласть("Отчет_о_реализации");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	НомСтроки = 0;
	
	Для НомерСтроки = 16 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Номер = ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			Если ПустаяСтрока(Номер) Или Число(Номер) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Артикул = ЛистДТ.Область(НомерСтроки, 3, НомерСтроки, 3).Текст;
			
			РеалСуммаТекст = ЛистДТ.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
			Если ПустаяСтрока(РеалСуммаТекст) Тогда
				РеалСумма = 0;
			Иначе 
				РеалСумма = Число(РеалСуммаТекст);	
			КонецЕсли;
			
			РеалВыплатаТекст = ЛистДТ.Область(НомерСтроки, 7, НомерСтроки, 7).Текст;
			Если ПустаяСтрока(РеалВыплатаТекст) Тогда
				РеалВыплата = 0;
			Иначе
				РеалВыплата = Число(РеалВыплатаТекст);
			КонецЕсли;
			
			РеалКоличествоТекст = ЛистДТ.Область(НомерСтроки, 8, НомерСтроки, 8).Текст;
			Если ПустаяСтрока(РеалКоличествоТекст) Тогда
				РеализованоКоличество = 0;
			Иначе
				РеализованоКоличество = Число(РеалКоличествоТекст);
			КонецЕсли;
			
			РеализованоСумма = РеалСумма + РеалВыплата;
			РеализованоЦена  = ?(РеализованоКоличество = 0, 0, РеализованоСумма / РеализованоКоличество);
			
			ВозвратСуммаТекст = ЛистДТ.Область(НомерСтроки, 10, НомерСтроки, 10).Текст;
			Если ПустаяСтрока(ВозвратСуммаТекст) Тогда
				ВозвратСумма = 0;
			Иначе
				ВозвратСумма = Число(ВозвратСуммаТекст);
			КонецЕсли;
			
			ВозвратВыплатаТекст = ЛистДТ.Область(НомерСтроки, 11, НомерСтроки, 11).Текст;
			Если ПустаяСтрока(ВозвратВыплатаТекст) Тогда
				ВозвратВыплата = 0;
			Иначе
				ВозвратВыплата = Число(ВозвратВыплатаТекст);
			КонецЕсли;
			
			ВозвратКоличествоТекст = ЛистДТ.Область(НомерСтроки, 12, НомерСтроки, 12).Текст;
			Если ПустаяСтрока(ВозвратКоличествоТекст) Тогда
				ВозвратКоличество = 0;
			Иначе
				ВозвратКоличество = Число(ВозвратКоличествоТекст);
			КонецЕсли;
			
			ВозвращеноСумма = ВозвратСумма + ВозвратВыплата;
			ВозвращеноЦена  = ?(ВозвратКоличество = 0, 0, ВозвращеноСумма / ВозвратКоличество);
			
			Если РеализованоКоличество > 0 Тогда
				Стр = Табл.Добавить();
				
				НомСтроки = НомСтроки + 1;
							
				Стр.НомерСтроки = НомСтроки;
				Стр.Артикул     = Артикул;
				Стр.Количество  = РеализованоКоличество;
				Стр.Сумма       = РеализованоСумма;
				Стр.Цена        = РеализованоЦена;
			КонецЕсли;
			
			Если ВозвратКоличество > 0 Тогда
				Стр = Табл.Добавить();
				
				НомСтроки = НомСтроки + 1;
				
				Стр.НомерСтроки = НомСтроки;
				Стр.Артикул     = Артикул;
				Стр.Количество  = -ВозвратКоличество;
				Стр.Сумма       = -ВозвращеноСумма;
				Стр.Цена        = ВозвращеноЦена;
			КонецЕсли;
		
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлOzon.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Данные = Новый Структура();
	Данные.Вставить("Продажа", Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлМагнитМаркет()
	ЛистДТ = ТабДок.ПолучитьОбласть("Chart_data");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	Счет = 0;
	Для НомерСтроки = 2 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Счет  = Счет + 1;
			
			Артикул = ЛистДТ.Область(НомерСтроки, 9, НомерСтроки, 9).Текст;
			
			Если ПустаяСтрока(Артикул) Тогда
				Продолжить;
			КонецЕсли;
			
			Количество = Число(ЛистДТ.Область(НомерСтроки, 17, НомерСтроки, 17).Текст);
			Цена       = Число(ЛистДТ.Область(НомерСтроки, 18, НомерСтроки, 18).Текст);
			
			Стр1 = Табл.Добавить();
			Стр1.НомерСтроки = Счет;
			Стр1.Артикул     = Артикул;
			Стр1.Количество  = Количество;
			Стр1.Цена        = Цена;
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлМагнитМаркет.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Данные = Новый Структура();
	
	Данные.Вставить("Продажа",  Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлWB()
	ЛистДТ = ТабДок.ПолучитьОбласть("Sheet1");
	
	Табл1 = ПолучитьСтруктуруДанныхОтчета();
	Табл2 = ПолучитьСтруктуруДанныхОтчета();
	
	Для НомерСтроки = 2 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			ТипДокумента = ВРег(СокрЛП(ЛистДТ.Область(НомерСтроки, 11, НомерСтроки, 11).Текст));
			
			Если ТипДокумента = "ПРОДАЖА" Или ТипДокумента = "ВОЗВРАТ" Тогда
				Стр = Табл1.Добавить();
				
				Стр.НомерСтроки  = Число(ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
				Стр.Артикул      = ЛистДТ.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
				Стр.Количество   = Число(ЛистДТ.Область(НомерСтроки, 14, НомерСтроки, 14).Текст);
				Стр.Цена         = Число(ЛистДТ.Область(НомерСтроки, 16, НомерСтроки, 16).Текст);
				
				Если ТипДокумента = "ВОЗВРАТ" Тогда
					Стр.Количество = -Стр.Количество;
				КонецЕсли;
			
			ИначеЕсли ТипДокумента = ВРег("Добровольная компенсация при возврате") Тогда
				Стр = Табл2.Добавить();
				
				Стр.НомерСтроки  = Число(ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст);
				Стр.Артикул      = ЛистДТ.Область(НомерСтроки, 6, НомерСтроки, 6).Текст;
				Стр.Количество   = Число(ЛистДТ.Область(НомерСтроки, 14, НомерСтроки, 14).Текст);
				Стр.Цена         = Число(ЛистДТ.Область(НомерСтроки, 34, НомерСтроки, 34).Текст);
			КонецЕсли; 
			
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлWB.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив1 = Новый Массив();
	Для Каждого Стр Из Табл1 Цикл
		Массив1.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Массив2 = Новый Массив();
	Для Каждого Стр Из Табл2 Цикл
		Массив2.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;
	
	Данные = Новый Структура();
	
	Данные.Вставить("Продажа", Массив1);
	Данные.Вставить("Списание", Неопределено);

	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлЯндексМаркет()
	
	ЛистДТ = ТабДок.ПолучитьОбласть("Доставленные_товары");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	НомСтроки = 0;
	
	Для НомерСтроки = 18 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Артикул = ЛистДТ.Область(НомерСтроки, 5, НомерСтроки, 5).Текст;
			Если ПустаяСтрока(Артикул) Тогда
				Продолжить;
			КонецЕсли;
			
			РеалКоличествоТекст = ЛистДТ.Область(НомерСтроки, 8, НомерСтроки, 8).Текст;
			РеалЦенаТекст       = ЛистДТ.Область(НомерСтроки, 18, НомерСтроки, 18).Текст;
			РеалСуммаТекст      = ЛистДТ.Область(НомерСтроки, 21, НомерСтроки, 21).Текст;
			
			Если ПустаяСтрока(РеалКоличествоТекст) Тогда РеализованоКоличество = 0; Иначе РеализованоКоличество = Число(РеалКоличествоТекст); КонецЕсли;
			Если ПустаяСтрока(РеалЦенаТекст) Тогда РеализованоЦена = 0; Иначе РеализованоЦена = Число(РеалЦенаТекст);	КонецЕсли;
			Если ПустаяСтрока(РеалСуммаТекст) Тогда РеализованоСумма = 0; Иначе РеализованоСумма = Число(РеалСуммаТекст);	КонецЕсли;
			
			Если РеализованоКоличество > 0 Тогда
				Стр = Табл.Добавить();
				
				НомСтроки = НомСтроки + 1;
							
				Стр.НомерСтроки = НомСтроки;
				Стр.Артикул     = Артикул;
				Стр.Количество  = РеализованоКоличество;
				Стр.Цена        = РеализованоЦена;
				Стр.Сумма       = РеализованоСумма;
			КонецЕсли;
			
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлЯндексМаркет.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;

	Данные = Новый Структура();
	Данные.Вставить("Продажа", Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервере
Функция ПрочитатьФайлВыкупаWB()
	ЛистДТ = ТабДок.ПолучитьОбласть("Sheet1");
	
	Табл = ПолучитьСтруктуруДанныхОтчета();
	
	Для НомерСтроки = 11 По ЛистДТ.ВысотаТаблицы Цикл
		Попытка
			Номер  = ЛистДТ.Область(НомерСтроки, 1, НомерСтроки, 1).Текст;
			
			Если СтрНайти(Номер, "Итого") > 0 Тогда
				Прервать;
			КонецЕсли;
			
			Стр = Табл.Добавить();
				
			Стр.НомерСтроки  = Число(Номер);
			Стр.Артикул      = ЛистДТ.Область(НомерСтроки, 2, НомерСтроки, 2).Текст;
			Стр.Количество   = Число(ЛистДТ.Область(НомерСтроки, 4, НомерСтроки, 4).Текст);
			Стр.Сумма        = Число(ЛистДТ.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
			Стр.СуммаНДС     = Число(ЛистДТ.Область(НомерСтроки, 5, НомерСтроки, 5).Текст);
			Стр.Цена         = Стр.Сумма / Стр.Количество;
			
		Исключение
			ТекстОшибки = НСтр("ru = 'AMS_Маркетплейс.ПрочитатьФайлВыкупаWB.Ошибка: Не удалось прочитать данные их файл отчета по причине: %Причина%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Причина%", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(ТекстОшибки, УровеньЖурналаРегистрации.Ошибка);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЦикла;
	
	Массив = Новый Массив();
	Для Каждого Стр Из Табл Цикл
		Массив.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Стр));	
	КонецЦикла;
	
	Данные = Новый Структура();
	Данные.Вставить("Продажа", Массив);
	Данные.Вставить("Списание", Неопределено);
	
	Возврат Данные;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруДанныхОтчета()
	Табл = Новый ТаблицаЗначений();
	
	Табл.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Табл.Колонки.Добавить("Артикул",     Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(20)));
	Табл.Колонки.Добавить("Количество",  Новый ОписаниеТипов("Число"));
	Табл.Колонки.Добавить("Цена",        Новый ОписаниеТипов("Число"));
	Табл.Колонки.Добавить("Сумма",       Новый ОписаниеТипов("Число"));
	Табл.Колонки.Добавить("СуммаНДС",    Новый ОписаниеТипов("Число"));
	
	Возврат Табл;
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокКомиссионеров()
	УстановитьПривилегированныйРежим(Истина);
	
	ГруппаДоступаМаркетплейс = Справочники.ГруппыДоступаПартнеров.НайтиПоНаименованию("Маркетплейс", Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГруппаДоступа", ГруппаДоступаМаркетплейс);

	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	т.Ссылка КАК Партнер,
	|	т.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Партнеры КАК т
	|ГДЕ
	|	т.ГруппаДоступа = &ГруппаДоступа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Табл = Запрос.Выполнить().Выгрузить();
	
	Если Табл.Количество() > 0 Тогда
		Элементы.Партнер.СписокВыбора.ЗагрузитьЗначения(Табл.ВыгрузитьКолонку("Партнер"));
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
